req.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"><soap:Header><wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To><wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Bye</wsa:Action><wsa:MessageID>urn:uuid:bb645594-240f-4233-9762-d09a735e2372</wsa:MessageID><wsd:AppSequence InstanceId="103" SequenceId="urn:uuid:5f761801-1f89-42e9-a625-e0f72a1c3bbb" MessageNumber="276"></wsd:AppSequence></soap:Header><soap:Body><wsd:Bye><wsa:EndpointReference><wsa:Address>urn:uuid:3c9bb80a-d37c-4710-984b-592112037c0e</wsa:Address></wsa:EndpointReference></wsd:Bye></soap:Body></soap:Envelope>